# Top-level Homebrew packages (formulae installed-on-request + installed casks)
# Generated on 2026-01-26.

# ------------------------------------------------------------------------------
# Shell, environment, and terminal workflow
# ------------------------------------------------------------------------------
brew "autoenv"
brew "autojump"
brew "bash"
brew "bash-completion"
brew "direnv"
brew "fpp"
brew "fzf"
brew "reattach-to-user-namespace"
brew "tmux"
brew "tmuxinator-completion"
brew "urlview"
brew "vim"
brew "watchman"

# ------------------------------------------------------------------------------
# Core CLI utilities
# ------------------------------------------------------------------------------
brew "coreutils"
brew "curl"
brew "diffutils"
brew "gawk"
brew "htop"
brew "ncurses"
brew "p7zip"
brew "pstree"
brew "rsync"
brew "tldr"
brew "trash"
brew "tree"
brew "wdiff"
brew "wget"

# ------------------------------------------------------------------------------
# Search, text, and data wrangling
# ------------------------------------------------------------------------------
brew "ack"
brew "bat"
brew "ccat"
brew "cloc"
brew "fd"
brew "ijq"
brew "jq"
brew "ripgrep"
brew "source-highlight"
brew "yq"

# ------------------------------------------------------------------------------
# Git and code review workflow
# ------------------------------------------------------------------------------
brew "diff-so-fancy"
brew "gh"
brew "git"
brew "tig"

# ------------------------------------------------------------------------------
# Code quality (linters, formatters, pre-commit)
# ------------------------------------------------------------------------------
brew "clang-format"
brew "golangci-lint"
brew "pre-commit"
brew "prettier"
brew "rubyfmt"
brew "shellcheck"

# ------------------------------------------------------------------------------
# Build systems, toolchains, and code generation
# ------------------------------------------------------------------------------
brew "autobench"
brew "autoconf"
brew "automake"
brew "bazelisk"
brew "buildifier"
brew "cmake"
brew "gcc"
brew "llvm"
brew "llvm@19"
brew "pkgconf"
brew "protobuf"
brew "thrift"
brew "tree-sitter"
brew "universal-ctags"

# ------------------------------------------------------------------------------
# Language runtimes and version managers
# ------------------------------------------------------------------------------
brew "asdf"
brew "go"
brew "goenv"
brew "jenv"
brew "lua"
brew "luajit"
brew "node"
brew "node-build"
brew "nodenv"
brew "openjdk"
brew "openjdk@11"
brew "pyenv"
brew "rbenv"
brew "ruby-build"
brew "rust-analyzer"
brew "rustup"
brew "uv"

# ------------------------------------------------------------------------------
# Cloud, Kubernetes, and IaC
# ------------------------------------------------------------------------------
brew "azure-cli"
brew "cloudflared"
brew "helm"
brew "kubeconform"
brew "terraform-ls"
brew "azure/kubelogin/kubelogin"
brew "derailed/k9s/k9s"
brew "warrensbox/tap/tfswitch"

# ------------------------------------------------------------------------------
# Networking, HTTP, and RPC tooling
# ------------------------------------------------------------------------------
brew "grpc"
brew "grpcurl"
brew "httperf"
brew "httpie"
brew "mosh"
brew "mtr"

# ------------------------------------------------------------------------------
# Databases and clients
# ------------------------------------------------------------------------------
brew "mycli"
brew "pgcli"
brew "postgresql@14"

# ------------------------------------------------------------------------------
# Security and crypto
# ------------------------------------------------------------------------------
brew "gnupg"
brew "jwt-cli"
brew "openssl@3"
brew "pinentry"
brew "pinentry-mac"

# ------------------------------------------------------------------------------
# Libraries (explicitly installed)
# ------------------------------------------------------------------------------
brew "abseil"
brew "fmt"
brew "harfbuzz"
brew "libevent"
brew "libfaketime"
brew "libmagic"
brew "libpng"
brew "libtool"
brew "libuv"
brew "libxslt"
brew "libyaml"
brew "mpich"
brew "msgpack"
brew "msgpack-cxx"
brew "re2"
brew "snappy"

# ------------------------------------------------------------------------------
# Misc (apps/tools)
# ------------------------------------------------------------------------------
brew "codex"
brew "cowsay"
brew "bottom"
brew "hugo"
brew "portaudio"
brew "prettyping"
brew "slides"

# ------------------------------------------------------------------------------
# Casks (GUI apps)
# ------------------------------------------------------------------------------

# Terminals and dev tools
cask "alacritty"
cask "bruno"
cask "mitmproxy"

# Diff / merge tools
cask "diffmerge"

# Databases
cask "clickhouse"

# Runtimes
cask "adoptopenjdk"
